app/controllers/actors_controller.rb

SELECT * FROM `roles` WHERE (`roles`.`name` = 'member') LIMIT 1
---
  def index
      @role = Role.find_by_name('herec')