app/controllers/clubs_controller.rb

SELECT * FROM `clubs` WHERE (`clubs`.`id` = 1)
---
  def edit
    @club = Club.find(params[:id])

SELECT * FROM `clubs` WHERE (`clubs`.`id` = 1)
---
  def show
    @club = Club.find(params[:id])

SELECT * FROM `clubs` WHERE (`clubs`.`id` = 1)
UPDATE `clubs` SET `updated_at` = '2010-03-25 14:09:36', `www` = '' WHERE `id` = 3
---
  def update
    @club = Club.find(params[:id])
    if @club.update_attributes(params[:club])