app/controllers/concerts_controller.rb

  def index
    @concerts = Concert.find(:all)
---
SELECT * FROM `concerts` WHERE (date >='2010-04-07') ORDER BY date DESC

  def create
    @concert = Concert.new(params[:concert])
    if @concert.save
---
INSERT INTO `concerts` (`name`, `updated_at`, `price`, `info`, `date`, `club_id`, `created_at`, `start_time`, `end_time`) VALUES('Dalsi koncert', '2010-03-25 17:59:38', 50.0, 'h shreh erknegknh erknekt n', NULL, 1, '2010-03-25 17:59:38', '2000-01-01 20:00:00', '2000-01-01 22:00:00')

  def edit
    @concert = Concert.find params[:id]
---
SELECT * FROM `concerts` WHERE (`concerts`.`id` = 1)

  def update
    @concert = Concert.find(params[:id])

    if @concert.update_attributes(params[:concert])
---
SELECT * FROM `concerts` WHERE (`concerts`.`id` = 1)
UPDATE `concerts` SET `updated_at` = '2010-03-05 16:37:22', `name` = 'Koncert na podporu Petra a kamosu' WHERE `id` = 1