app/controllers/main_controller.rb

SELECT * FROM `roles` WHERE (`roles`.`name` = 'member') LIMIT 1
---
  def about_us

    @members = Role.find_by_name('member').users