app/controllers/news_controller.rb

INSERT INTO `news` (`updated_at`, `body`, `header`, `valid_from`, `valid_until`, `created_at`) VALUES('2010-02-09 22:03:43', NULL, NULL, NULL, NULL, '2010-02-09 22:03:43')
---
  def create
    @news = News.new(params[:news])
    if @news.save

SELECT * FROM `news` WHERE (`news`.`id` = 1)
---
  def edit
    @news = News.find(params[:id])

SELECT * FROM `news` WHERE (`news`.`id` = 1)
---
  def show
    @news = News.find(params[:id])

SELECT * FROM `news` WHERE (`news`.`id` = 1)
UPDATE `news` SET `valid_until` = '2010-03-16 00:00:00', `updated_at` = '2010-03-21 21:24:48' WHERE `id` = 1
---
  def update
    @news = News.find(params[:id])

    if @news.update_attributes(params[:news])

SELECT * FROM `news` WHERE (`news`.`id` = 1)
DELETE FROM `news` WHERE `id` = 1
---
  def destroy
    @news = News.find(params[:id])
    @news.destroy