app/controllers/roles_controller.rb

SELECT * FROM `roles` WHERE (`roles`.`id` = 2)
---
  def index
    @roles = Role.find(:all)

INSERT INTO `roles` (`name`, `updated_at`, `created_at`) VALUES('zk', '2010-03-21 19:33:59', '2010-03-21 19:33:59')
---
  def create
    @role = Role.new(params[:role])
     if @role.save

SELECT * FROM `roles` WHERE (`roles`.`id` = 1)
---
  def edit
    @role = Role.find(params[:id])

SELECT * FROM `roles` WHERE (`roles`.`id` = 1)
UPDATE `roles` SET `updated_at` = '2010-03-21 19:31:08', `name` = 'host' WHERE `id` = 1
---
  def update
    @role = Role.find(params[:id])
    if @role.update_attributes(params[:role])

SELECT * FROM `roles` WHERE (`roles`.`id` = 3)
DELETE FROM `roles` WHERE `id` = 3
---
  def destroy
    @role = Role.find(params[:id])
    @role.destroy