app/controllers/users_controller.rb

SELECT * FROM `users` WHERE (`users`.`id` = '1') LIMIT 1
---
  def index
    @users = User.find(:all)

INSERT INTO `users` (`lastName`, `updated_at`, `crypted_password`, `info`, `role_id`, `password_salt`, `firstName`, `persistence_token`, `login`, `email`, `created_at`) VALUES('Jagr', '2010-03-21 10:58:16', '02b51d4c380572493c8e5f2722eda44bf651b7a8b12a877787ca683cca3cbee189d267ddeede4248babf39e9b9899db8e3f3dd9c35ce72bf06e13f83e19ef840', 'Kuuuuuuhuuuuuuumuuuuuu', 1, 'TWPCDqRf8NVzogjv0B9x', 'Filip', '23d2e42765ec2f841cb4000161fccf884fdf824df236f56e9d2c45f0e8c31ab7bd022ec5f55c1f7a15fd8d008a17a9a5062c688f46c47438ff0b4f8a138dbfa5', 'filip', 'f.jagr@seznam.cz', '2010-03-21 10:58:16')
---
  def create
    @user = User.new(params[:user])
     if @user.save

SELECT * FROM `users` WHERE (`users`.`id` = '1') LIMIT 1
UPDATE `users` SET `persistence_token` = 'fac63466bb5f7407381d926362333a6a1a6fdb0655824098c11c3d2121e4c3de5124a57923cd142e2a8ac01e430a8b542b0782878b7ce72617ff2bb110f3de5e', `crypted_password` = 'ceb638c90313e0852e5b04a90f6f26f483da50164b5c6f2e22725af26e42f2f09fe03143c991d4b3fdf40e0be9adfd6127484e7e1b3d8bc7a97d2e4104eba3c2', `updated_at` = '2010-03-20 17:36:23', `password_salt` = 'vbUXX-fu-8KFoyuLg6WJ' WHERE `id` = 1
---
  def update
    @user = User.find(params[:id])
    if @user.update_attributes(params[:user])